InformationRegisters/РасценкиЗанятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>РасценкиЗанятий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДлительностьЗанятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДлительностьЗанятий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РасценкиЗанятий/Ext/ManagerModule.bsl
Функция ПолучитьЦенуЗанятия(Преподаватель, Длительность, Обучающийся) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РасценкиЗанятийСрезПоследних.Цена
	                      |ИЗ
	                      |	РегистрСведений.РасценкиЗанятий.СрезПоследних(
	                      |			,
	                      |			Преподаватель = &Преподаватель
	                      |				И ДлительностьЗанятия = &Длительность
	                      |				И Обучающийся = &Обучающийся) КАК РасценкиЗанятийСрезПоследних");
	Запрос.УстановитьПараметр("Преподаватель",	Преподаватель);
	Запрос.УстановитьПараметр("Длительность",	Длительность);
	Запрос.УстановитьПараметр("Обучающийся", Обучающийся);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции


Функция ПолучитьРасценкиЗанятий(Преподаватель, Обучающийся) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЕСТЬNULL(РасценкиЗанятийСрезПоследних.Цена, 0) КАК Цена,
	                      |	ДлительностьЗанятий.Ссылка КАК ДлительностьЗанятия
	                      |ИЗ
	                      |	Справочник.ДлительностьЗанятий КАК ДлительностьЗанятий
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиЗанятий.СрезПоследних(
	                      |				,
	                      |				Преподаватель = &Преподаватель
	                      |					И Обучающийся = &Обучающийся) КАК РасценкиЗанятийСрезПоследних
	                      |		ПО ДлительностьЗанятий.Ссылка = РасценкиЗанятийСрезПоследних.ДлительностьЗанятия
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	РасценкиЗанятийСрезПоследних.ДлительностьЗанятия.ЗначениеМинут,
	                      |	Цена");
	Запрос.УстановитьПараметр("Преподаватель",	Преподаватель);
	Запрос.УстановитьПараметр("Обучающийся", Обучающийся);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции
